# Pyspark Handling Missing Values
Dropping Columns

Dropping Rows

Various Parameter In Dropping functionalities

Handling Missing values by Mean, Median And Mode

# Starting Spark Session

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName('Handling Values').getOrCreate()

In [3]:
spark

# Loading DataSet

In [23]:
#Loading dataset
#spark.read.csv('file_example_1.csv',header=True,inferschema=True)
df_spark = spark.read.option('header','true').csv('file_example_1.csv',inferSchema=True)
df_spark.show()

+---+----------+---------+------+-------------+----+----------+----+
|  0|First Name|Last Name|Gender|      Country| Age|      Date|  Id|
+---+----------+---------+------+-------------+----+----------+----+
|  1|     Dulce|    Abril|Female|United States|  32|15-10-2017|1562|
|  2|      Mara|Hashimoto|Female|Great Britain|  25|16-08-2016|1582|
|  3|    Philip|     Gent|  Male|       France|  36|21-05-2015|2587|
|  4|  Kathleen|   Hanner|Female|United States|  25|15-10-2017|3549|
|  5|   Nereida|  Magwood|Female|United States|  58|16-08-2016|2468|
|  6|    Gaston|    Brumm|  Male|United States|  24|21-05-2015|2554|
|  7|      Etta|     Hurn|Female|Great Britain|  56|15-10-2017|3598|
|  8|   Earlean|   Melgar|Female|United States|  27|16-08-2016|2456|
|  9|  Vincenza|  Weiland|Female|United States|  40|21-05-2015|6548|
| 10|      null| Vachhani|  null|        India|  23|      null|5647|
| 11|     Vivek|     null|  Male|        India|null|      null|6666|
| 12|      null|    Patel|  null|         null|  26|      null|9999|
+---+----------+---------+------+-------------+----+----------+----+

# Handling Data

## Drop NULL Values

In [26]:
## drop NUll columns
df_spark = df_spark.drop('Date','Id')
df_spark.show()

+---+----------+---------+------+-------------+----+
|  0|First Name|Last Name|Gender|      Country| Age|
+---+----------+---------+------+-------------+----+
|  1|     Dulce|    Abril|Female|United States|  32|
|  2|      Mara|Hashimoto|Female|Great Britain|  25|
|  3|    Philip|     Gent|  Male|       France|  36|
|  4|  Kathleen|   Hanner|Female|United States|  25|
|  5|   Nereida|  Magwood|Female|United States|  58|
|  6|    Gaston|    Brumm|  Male|United States|  24|
|  7|      Etta|     Hurn|Female|Great Britain|  56|
|  8|   Earlean|   Melgar|Female|United States|  27|
|  9|  Vincenza|  Weiland|Female|United States|  40|
| 10|      null| Vachhani|  null|        India|  23|
| 11|     Vivek|     null|  Male|        India|null|
| 12|      null|    Patel|  null|         null|  26|
+---+----------+---------+------+-------------+----+

In [27]:
## Will delete all the rows with NULL values
df_spark.na.drop().show()

+---+----------+---------+------+-------------+---+
|  0|First Name|Last Name|Gender|      Country|Age|
+---+----------+---------+------+-------------+---+
|  1|     Dulce|    Abril|Female|United States| 32|
|  2|      Mara|Hashimoto|Female|Great Britain| 25|
|  3|    Philip|     Gent|  Male|       France| 36|
|  4|  Kathleen|   Hanner|Female|United States| 25|
|  5|   Nereida|  Magwood|Female|United States| 58|
|  6|    Gaston|    Brumm|  Male|United States| 24|
|  7|      Etta|     Hurn|Female|Great Britain| 56|
|  8|   Earlean|   Melgar|Female|United States| 27|
|  9|  Vincenza|  Weiland|Female|United States| 40|
+---+----------+---------+------+-------------+---+

In [28]:
## any=How
#If 'any', drop a row if it contains any nulls.
#     If 'all', drop a row only if all its values are null.
df_spark.na.drop(how='any').show()

+---+----------+---------+------+-------------+---+
|  0|First Name|Last Name|Gender|      Country|Age|
+---+----------+---------+------+-------------+---+
|  1|     Dulce|    Abril|Female|United States| 32|
|  2|      Mara|Hashimoto|Female|Great Britain| 25|
|  3|    Philip|     Gent|  Male|       France| 36|
|  4|  Kathleen|   Hanner|Female|United States| 25|
|  5|   Nereida|  Magwood|Female|United States| 58|
|  6|    Gaston|    Brumm|  Male|United States| 24|
|  7|      Etta|     Hurn|Female|Great Britain| 56|
|  8|   Earlean|   Melgar|Female|United States| 27|
|  9|  Vincenza|  Weiland|Female|United States| 40|
+---+----------+---------+------+-------------+---+

In [31]:
## Threshold =4
# It Will check atleast 4 non-Null Values in a row
df_spark.na.drop(how='any',thresh=4).show()

+---+----------+---------+------+-------------+----+
|  0|First Name|Last Name|Gender|      Country| Age|
+---+----------+---------+------+-------------+----+
|  1|     Dulce|    Abril|Female|United States|  32|
|  2|      Mara|Hashimoto|Female|Great Britain|  25|
|  3|    Philip|     Gent|  Male|       France|  36|
|  4|  Kathleen|   Hanner|Female|United States|  25|
|  5|   Nereida|  Magwood|Female|United States|  58|
|  6|    Gaston|    Brumm|  Male|United States|  24|
|  7|      Etta|     Hurn|Female|Great Britain|  56|
|  8|   Earlean|   Melgar|Female|United States|  27|
|  9|  Vincenza|  Weiland|Female|United States|  40|
| 10|      null| Vachhani|  null|        India|  23|
| 11|     Vivek|     null|  Male|        India|null|
+---+----------+---------+------+-------------+----+

In [32]:
## Subset = Gender
# Will delete all the row where Null value is present in Gender column
df_spark.na.drop(how='any',subset=['Gender']).show()

+---+----------+---------+------+-------------+----+
|  0|First Name|Last Name|Gender|      Country| Age|
+---+----------+---------+------+-------------+----+
|  1|     Dulce|    Abril|Female|United States|  32|
|  2|      Mara|Hashimoto|Female|Great Britain|  25|
|  3|    Philip|     Gent|  Male|       France|  36|
|  4|  Kathleen|   Hanner|Female|United States|  25|
|  5|   Nereida|  Magwood|Female|United States|  58|
|  6|    Gaston|    Brumm|  Male|United States|  24|
|  7|      Etta|     Hurn|Female|Great Britain|  56|
|  8|   Earlean|   Melgar|Female|United States|  27|
|  9|  Vincenza|  Weiland|Female|United States|  40|
| 11|     Vivek|     null|  Male|        India|null|
+---+----------+---------+------+-------------+----+

In [33]:
## Filling the Missing the Values
df_spark.na.fill('Missing Values').show()

+---+--------------+--------------+--------------+--------------+----+
|  0|    First Name|     Last Name|        Gender|       Country| Age|
+---+--------------+--------------+--------------+--------------+----+
|  1|         Dulce|         Abril|        Female| United States|  32|
|  2|          Mara|     Hashimoto|        Female| Great Britain|  25|
|  3|        Philip|          Gent|          Male|        France|  36|
|  4|      Kathleen|        Hanner|        Female| United States|  25|
|  5|       Nereida|       Magwood|        Female| United States|  58|
|  6|        Gaston|         Brumm|          Male| United States|  24|
|  7|          Etta|          Hurn|        Female| Great Britain|  56|
|  8|       Earlean|        Melgar|        Female| United States|  27|
|  9|      Vincenza|       Weiland|        Female| United States|  40|
| 10|Missing Values|      Vachhani|Missing Values|         India|  23|
| 11|         Vivek|Missing Values|          Male|         India|null|
| 12|Missing Values|         Patel|Missing Values|Missing Values|  26|
+---+--------------+--------------+--------------+--------------+----+

In [35]:
# can give list of columns
df_spark.na.fill('Missing Values','Gender').show()

+---+----------+---------+--------------+-------------+----+
|  0|First Name|Last Name|        Gender|      Country| Age|
+---+----------+---------+--------------+-------------+----+
|  1|     Dulce|    Abril|        Female|United States|  32|
|  2|      Mara|Hashimoto|        Female|Great Britain|  25|
|  3|    Philip|     Gent|          Male|       France|  36|
|  4|  Kathleen|   Hanner|        Female|United States|  25|
|  5|   Nereida|  Magwood|        Female|United States|  58|
|  6|    Gaston|    Brumm|          Male|United States|  24|
|  7|      Etta|     Hurn|        Female|Great Britain|  56|
|  8|   Earlean|   Melgar|        Female|United States|  27|
|  9|  Vincenza|  Weiland|        Female|United States|  40|
| 10|      null| Vachhani|Missing Values|        India|  23|
| 11|     Vivek|     null|          Male|        India|null|
| 12|      null|    Patel|Missing Values|         null|  26|
+---+----------+---------+--------------+-------------+----+

In [36]:
df_spark.show()

+---+----------+---------+------+-------------+----+
|  0|First Name|Last Name|Gender|      Country| Age|
+---+----------+---------+------+-------------+----+
|  1|     Dulce|    Abril|Female|United States|  32|
|  2|      Mara|Hashimoto|Female|Great Britain|  25|
|  3|    Philip|     Gent|  Male|       France|  36|
|  4|  Kathleen|   Hanner|Female|United States|  25|
|  5|   Nereida|  Magwood|Female|United States|  58|
|  6|    Gaston|    Brumm|  Male|United States|  24|
|  7|      Etta|     Hurn|Female|Great Britain|  56|
|  8|   Earlean|   Melgar|Female|United States|  27|
|  9|  Vincenza|  Weiland|Female|United States|  40|
| 10|      null| Vachhani|  null|        India|  23|
| 11|     Vivek|     null|  Male|        India|null|
| 12|      null|    Patel|  null|         null|  26|
+---+----------+---------+------+-------------+----+

In [39]:
# Handling INTEGER value

from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['Age'],
    outputCols=['{}_imputed'.format(c) for c in ['Age']]
).setStrategy('mean')

In [40]:
# Add Imputer cols to df_spark
imputer.fit(df_spark).transform(df_spark).show()

+---+----------+---------+------+-------------+----+-----------+
|  0|First Name|Last Name|Gender|      Country| Age|Age_imputed|
+---+----------+---------+------+-------------+----+-----------+
|  1|     Dulce|    Abril|Female|United States|  32|         32|
|  2|      Mara|Hashimoto|Female|Great Britain|  25|         25|
|  3|    Philip|     Gent|  Male|       France|  36|         36|
|  4|  Kathleen|   Hanner|Female|United States|  25|         25|
|  5|   Nereida|  Magwood|Female|United States|  58|         58|
|  6|    Gaston|    Brumm|  Male|United States|  24|         24|
|  7|      Etta|     Hurn|Female|Great Britain|  56|         56|
|  8|   Earlean|   Melgar|Female|United States|  27|         27|
|  9|  Vincenza|  Weiland|Female|United States|  40|         40|
| 10|      null| Vachhani|  null|        India|  23|         23|
| 11|     Vivek|     null|  Male|        India|null|         33|
| 12|      null|    Patel|  null|         null|  26|         26|
+---+----------+---------+------+-------------+----+-----------+